Autodesk.Revit.DB.TransactWithCentralOptions.SetLockCallback(Autodesk.Revit.DB.ICentralLockedCallback)
Sets or resets a callback object that would allow an external application to change Revit's default behavior of endlessly waiting and repeatedly trying to lock a central model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014